{
  "title": "Shields of Arcadia",
  "intro": "Welcome Mortals to another edition of Shields of Arcadia! Your favorite quest of the Vulcanverse. The quest will last for 2h from now on.\n\nEveryone who wanna join would need to react with :fire: to this message.\nAfter doing so the Quest bot will send you a DM with the start of the quest. Good luck!",
  "riddles": [
    {
      "message": "Our time in Arcadia is coming to a close, and we must prepare for the dark side of the Vulcan Verse, Hades.\n\nSafety is of the upmost importance, and we  must be well equipped. I ahve heard rumour of a secret cache of enchanted shields, but the path to find them is tricky.\n\nFollow the North road until you find four stone arches surrounding a fire pit. This meeting place, once frequented by a group of Arcadian outlaws has now fallen into ruin.\n\nCount the rocks around the fire for me and I will tell you your next direction. How many were there?",
      "answer": "6",
      "hint": "TBD",
      "img": [
        {
          "name": "compas.png",
          "url": "./quests/shields/img/shield_3.png"
        }
      ]
    },
    {
      "message": "Well done Mortal. I didnt expect less from you\n\nHead through the trees, past Don Quijote's house and SirDrinks settlement until you reach an old outlook known as the High Steps. Climb to the top of these steps and look to the North to find your next destination. A raised platform, marked by two Arcadian banners. Used by Arcadian generals to watch their soldiers treain, this viewing platform has seen much bloodshred.\n\n Count the chairs for me and I may tell you to which direction to look.",
      "answer": "8",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "That was an easy one right?\nWell, if you look around you will see a famous landmark, high on a hill, go there. Climb the steps and pay tribute to the Gods, we will need their blessings in Hades. Now unused, flowers have started to overgrow this shrine, it is said that these blooms contain magical properties.\n\n Go there and take note of the colour of these flowers. Come back to me with your answer",
      "answer": "Purple",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "Exactly!\n\nThe view here is spectacular, and if you look around at the surrounding scenery you will see ur nest destination, marked by a blue X. It is rumoured that a valuable treasure was buried here, try your luck at foraging and tell me what you found. Send me a picture of it to DangerMous#6766 and come back here with the clue to continue",
      "answer": "red",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "It seems you are used to forage this lands! Move 5 plots to the west from your actual position. Then 2 plots South\n\nThis new training ground. The Olympus Run, is designer for only the strongest warriors. It combines parkour, a maze and a tower climb and will prepare you for anything you might find in battle. Climb to the top of the tower and face South. Send me a screenshot of the views to @DangerMous#6766 and come back here with the clue that I gave you",
      "answer": "red",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "Good job! Arcadia needs fit warriors like you.\n\nOn the horizon you will see a popular Arcadian landmark, where you will find a bearded statue. He's either cross-eyed with wine or something seems to have caught his eye. Follow the direction of hiz gaze carefully, and discover a creature, saddled and ready for war. Familiarise yourself with the beast, as you may need his service in the future.\n\nAfter you do, could you let me know what kind of beast did you found?",
      "answer": "Elephant",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "Head West, to Vulcans final resting place, where the festival of Vulcan, 'The Vulcanalia' is being celebrated. Each summer when the heat places crops and granaries at risk of burning, local folk created vonfires in hnour of Vulcan. Some of these can still be seen upon his hammer.\n\nCount the fires and come to me with your answer.",
      "answer": "18",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "Now begins the long trek North to the coast, head to Kinf Lykaon's Den, located in the ruins North of Deep Forest. Climb atop the highest point of these ruins(the East Wall), turn North East and locate your final destination in the distance.\n\n Upon arrival, you will need to seek out Nirena. She has bought us many supplies, most importantly though are the shields.\n\n How many shields have Nirena bring with her Mortal?",
      "answer": "26",
      "hint": "Do u really ask a god for this?"
    },
    {
      "message": "That's it. Well done Mortal. Return to me at plot 5278 and claim your prize.",
      "hint": "Do u really ask a god for this?"
    }
  ]
}